public class Main {
    public static void main(String[] args) {
        Human [] soldiers = new Soldier[6];
        Human [] commanders = new Commander[2];
        General general = new General();
        Human [] headquarter = new Human[];
        headquarter[0] = soldiers[];
        headquarter[1] = commanders[];
        headquarter[2] = general;

    }

}


//"Створити класи (мінімум по 2 поля і одному методу),
//+ які дозволять описати наступні сутності: ЛЮДИНА, СОЛДАТ, КОМАНДИР, ГЕНЕРАЛ
//+ знаючи, що генерал, солдат і командир - це люди,
// при цьому від командира залежать 3 солдат, а від генерала 2 командира.
//+ Людина повинна імліментувати інтерфейс ЗДАТНИЙ_ДО_БОЙОВИХ_ДІЙ,
//+ який буде мати два методи: МОЖУ_ВОЮВАТИ і ДОПОВІДАТИ.
// Дані методи повинні викидати власне виключення, що перевірється.
// Створити штаб (в main методі один спільний масив) з 6 солдат, 2 командирів і генерала.
// Кожна особа повинна доповісти, у кого перебуває в підпорядкуванні і про можливість воювати."